KunYi/M480_VSCODE_Template/src/webserver.c

#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "semphr.h"

#include "lwip/opt.h"
#include "lwip/netifapi.h"
#include "lwip/tcpip.h"
#include "netif/ethernetif.h"
#include "lwip/apps/httpd.h"
#include "lwip/def.h"
#include "lwip/mem.h"
#include "NuMicro.h"

#include "netif/m480_eth.h"

#include "main.h"
#include "utils.h"

#include <stdio.h>
#include <string.h>

void httpd_ext_init(void);
static void cgi_ex_init(void);
static void ssi_ex_init(void);
extern struct Configuration cfg;

/*
 * -------------------------------------------------------------------------------------------------------
 *  CGI Support Part
 * -------------------------------------------------------------------------------------------------------
 */
#if !LWIP_HTTPD_CGI
#error LWIP_HTTPD_EXAMPLE_CGI_SIMPLE needs LWIP_HTTPD_CGI
#endif

static const char *cgi_handler_config(int iIndex, int iNumParams, char *pcParam[], char *pcValue[]);
static const char *cgi_handler_ip(int iIndex, int iNumParams, char *pcParam[], char *pcValue[]);
static const char *cgi_handler_misc(int iIndex, int iNumParams, char *pcParam[], char *pcValue[]);
static const char *cgi_handler_defaults(int iIndex, int iNumParams, char *pcParam[], char *pcValue[]);

static const tCGI cgi_handlers[] = {
  {
    "/config.cgi",
    cgi_handler_config
  },
  {
    "/ip.cgi",
    cgi_handler_ip
  },
  {
    "/misc.cgi",
    cgi_handler_misc
  },
  {
    "/defaults.cgi",
    cgi_handler_defaults
  }
};

static void cgi_ex_init(void)
{
  http_set_cgi_handlers(cgi_handlers, LWIP_ARRAYSIZE(cgi_handlers));
}

/** This config CGI function can parse param/value pairs and return an url that
 * is sent as a response by httpd.
 *
 * This example function just checks that the input url has two key value
 * parameter pairs: "foo=bar" and "test=123"
 * If not, it returns 404
 */
static const char *
cgi_handler_config(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
  LWIP_ASSERT("check index", iIndex < LWIP_ARRAYSIZE(cgi_handlers));

  if (iNumParams == 2) {
    if (!strcmp(pcParam[0], "foo")) {
      if (!strcmp(pcValue[0], "bar")) {
        if (!strcmp(pcParam[1], "test")) {
          if (!strcmp(pcValue[1], "123")) {
            return "/index.html";
          }
        }
      }
    }
  }
  return "/404.html";
}

static const char *
cgi_handler_ip(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
  LWIP_ASSERT("check index", iIndex < LWIP_ARRAYSIZE(cgi_handlers));

  if (iNumParams == 2) {
    if (!strcmp(pcParam[0], "foo")) {
      if (!strcmp(pcValue[0], "bar")) {
        if (!strcmp(pcParam[1], "test")) {
          if (!strcmp(pcValue[1], "123")) {
            return "/index.html";
          }
        }
      }
    }
  }
  return "/404.html";
}

static const char *
cgi_handler_misc(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
  LWIP_ASSERT("check index", iIndex < LWIP_ARRAYSIZE(cgi_handlers));
  //printf("pcParam[0]:%s, pcValue[0]:%s\n", pcParam[0], pcValue[0]);
  if (iNumParams == 2) {
    if (!strcmp(pcParam[0], "foo")) {
      if (!strcmp(pcValue[0], "bar")) {
        if (!strcmp(pcParam[1], "test")) {
          if (!strcmp(pcValue[1], "123")) {
            return "/index.html";
          }
        }
      }
    }
  }
  return "/404.html";
}

static const char *
cgi_handler_defaults(int iIndex, int iNumParams, char *pcParam[], char *pcValue[])
{
  LWIP_ASSERT("check index", iIndex < LWIP_ARRAYSIZE(cgi_handlers));
  printf("pcParam[0]:%s, pcValue[0]:%s\n", pcParam[0], pcValue[0]);
  if (iNumParams == 2) {
    if (!strcmp(pcParam[0], "foo")) {
      if (!strcmp(pcValue[0], "bar")) {
        if (!strcmp(pcParam[1], "test")) {
          if (!strcmp(pcValue[1], "123")) {
            return "/index.html";
          }
        }
      }
    }
  }
  return "/404.html";
}


/*
 * -------------------------------------------------------------------------------------------------------
 *  End of CGI Support Part
 * -------------------------------------------------------------------------------------------------------
 */

/*
 * -------------------------------------------------------------------------------------------------------
 *  SSI Support Part
 * -------------------------------------------------------------------------------------------------------
 */
/** define LWIP_HTTPD_EXAMPLE_SSI_SIMPLE_CGI_INTEGRATION to 1 to show how to
 * integrate CGI into SSI (LWIP_HTTPD_CGI_SSI) */

#if !LWIP_HTTPD_CGI_SSI
#error LWIP_HTTPD_EXAMPLE_SSI_SIMPLE_CGI_INTEGRATION needs LWIP_HTTPD_CGI_SSI
#endif

#define MAX_CGI_LEN   16

enum  _SSI_TAGS_INDEX {
  SSI_IDX_IPADDR = 0,
  SSI_IDX_MACADDR,
  SSI_IDX_MODNAME,
  SSI_IDX_PORT0_BAUDRATE,
  SSI_IDX_PORT0_DATALENGTH,
  SSI_IDX_PORT0_PARITY,
  SSI_IDX_PORT0_STOPBITS,
  SSI_IDX_PORT0_FLOWCONTROL,
  SSI_IDX_PORT1_BAUDRATE,
  SSI_IDX_PORT1_DATALENGTH,
  SSI_IDX_PORT1_PARITY,
  SSI_IDX_PORT1_STOPBITS,
  SSI_IDX_PORT1_FLOWCONTROL,
  SSI_IDX_PORT0_TLP,
  SSI_IDX_PORT0_TRP,
  SSI_IDX_PORT0_TNM,
  SSI_IDX_PORT0_TPROT,
  SSI_IDX_PORT0_TIP,
  SSI_IDX_PORT0_TTO,
  SSI_IDX_PORT1_TLP,
  SSI_IDX_PORT1_TRP,
  SSI_IDX_PORT1_TNM,
  SSI_IDX_PORT1_TPROT,
  SSI_IDX_PORT1_TIP,
  SSI_IDX_PORT1_TTO,
  SSI_IDX_P0CFG_VARS,
  SSI_IDX_P1CFG_VARS,
  SSI_IDX_MISC_VARS,
  SSI_IDX_HOSTNAME_INP,
};

const char * ssi_example_tags[] = {
  "ipaddr",
  "macaddr",
  "modname",
  "p0br", /* baudrate */
  "p0dl", /* data length */
  "p0p",  /* parity */
  "p0sb", /* stop bits */
  "p0fc", /* flow control */
  "p1br", /* baudrate */
  "p1dl", /* data length */
  "p1p",  /* parity */
  "p1sb", /* stop bits */
  "p1fc", /* flow control */
  "p0tlp",  /* local telnet port */
  "p0trp",  /* remote telnet port */
  "p0tnm",  /* telmode */
  "p0prot", /* telnet protocol */
  "p0tip",  /* telnet server ip */
  "p0tt",   /* telnet timeout */
  "p1tlp",  /* local telnet port */
  "p1trp",  /* remote telnet port */
  "p1tnm",  /* telmode */
  "p1prot", /* telnet protocol */
  "p1tip",  /* telnet server ip */
  "p1tt",   /* telnet timeout */
  "p0cvars",
  "p1cvars",
  "misvars",
  "hstninp", /* hostname name input */
#if LWIP_HTTPD_EXAMPLE_SSI_SIMPLE_CGI_INTEGRATION
  ,"CgiParam"
#endif
};

const char script_start[] = "<script type='text/javascript'><!--\n";
const char script_end[] = "--></script>\n";

const char ser_vars_fmt[] = \
  "var br = %u;\n"   \
  "var dl = %u;\n"   \
  "var par = %u;\n"  \
  "var sb = %u;\n"   \
  "var fc = %u;\n";

const char telnet_vars_fmt[] = \
  "var tt = %u;\n"   \
  "var tlp = %u;\n"  \
  "var trp = %u;\n"  \
  "var tnm = %u;\n"  \
  "var tnp = %u;\n";

const char telnet_ip_vars_fmt[] = \
  "var tip1 = %d;\n" \
  "var tip2 = %d;\n" \
  "var tip3 = %d;\n" \
  "var tip4 = %d;\n";

