KunYi/M480_VSCODE_Template/src/webserver.c
const char static_ip_vars_fmt[] = \
  "var staticip = %d;\n"  \
  "var sip1 = %d;\n"      \
  "var sip2 = %d;\n"      \
  "var sip3 = %d;\n"      \
  "var sip4 = %d;\n";

const char netmask_vars_fmt[] = \
  "var mip1 = %d;\n"  \
  "var mip2 = %d;\n"  \
  "var mip3 = %d;\n"  \
  "var mip4 = %d;\n";

const char gateway_vars_fmt[] = \
  "var gip1 = %d;\n"  \
  "var gip2 = %d;\n"  \
  "var gip3 = %d;\n"  \
  "var gip4 = %d;\n";

const char hostname_inp_vars_fmt[] = \
  "<input maxlength=32 name=devicename value=\"%s\">";

u16_t ssi_example_ssi_handler(
#if LWIP_HTTPD_SSI_RAW
                             const char* ssi_tag_name,
#else /* LWIP_HTTPD_SSI_RAW */
                             int iIndex,
#endif /* LWIP_HTTPD_SSI_RAW */
                             char *pcInsert, int iInsertLen
#if LWIP_HTTPD_SSI_MULTIPART
                             , u16_t current_tag_part, u16_t *next_tag_part
#endif /* LWIP_HTTPD_SSI_MULTIPART */
#if defined(LWIP_HTTPD_FILE_STATE) && LWIP_HTTPD_FILE_STATE
                             , void *connection_state
#endif /* LWIP_HTTPD_FILE_STATE */
                             )
{
  size_t printed;
#if LWIP_HTTPD_SSI_RAW
  /* a real application could use if(!strcmp) blocks here, but we want to keep
     the differences between configurations small, so translate string to index here */
  int iIndex;
  for (iIndex = 0; iIndex < LWIP_ARRAYSIZE(ssi_example_tags); iIndex++) {
    if(!strcmp(ssi_tag_name, ssi_example_tags[iIndex])) {
      break;
    }
  }
#endif
#if defined(LWIP_HTTPD_FILE_STATE) && LWIP_HTTPD_FILE_STATE
  LWIP_UNUSED_ARG(connection_state);
#endif

  switch (iIndex) {
  case SSI_IDX_IPADDR:
    printed = snprintf(pcInsert, iInsertLen, "192.168.10.120");
    break;
  case SSI_IDX_MACADDR:
    {
      printed = snprintf(pcInsert, iInsertLen, "%02X:%02X:%02X:%02X:%02X:%02X",
          cfg.macaddr[0], cfg.macaddr[1], cfg.macaddr[2],
          cfg.macaddr[3], cfg.macaddr[4], cfg.macaddr[5]);
    }
    break;
  case SSI_IDX_MODNAME:
    {
       printed = snprintf(pcInsert, iInsertLen, "%s", "UxConn");
    }
    break;
  case SSI_IDX_PORT0_BAUDRATE:
  case SSI_IDX_PORT1_BAUDRATE:
    printed = snprintf(pcInsert, iInsertLen,  "%d", 115200);
    break;
  case SSI_IDX_PORT0_DATALENGTH:
  case SSI_IDX_PORT1_DATALENGTH:
    printed = snprintf(pcInsert, iInsertLen,  "%d", 8);
    break;
  case SSI_IDX_PORT0_PARITY:
  case SSI_IDX_PORT1_PARITY:
    printed = snprintf(pcInsert, iInsertLen, "%s", "None");
    break;
  case SSI_IDX_PORT0_STOPBITS:
  case SSI_IDX_PORT1_STOPBITS:
    printed = snprintf(pcInsert, iInsertLen, "%d", 1);
    break;
  case SSI_IDX_PORT0_FLOWCONTROL:
  case SSI_IDX_PORT1_FLOWCONTROL:
    printed = snprintf(pcInsert, iInsertLen, "%s", "None");
    break;
  case SSI_IDX_PORT0_TLP:
  case SSI_IDX_PORT1_TLP:
    printed = snprintf(pcInsert, iInsertLen, "%d", 23);
    break;
  case SSI_IDX_PORT0_TRP:
  case SSI_IDX_PORT1_TRP:
    printed = snprintf(pcInsert, iInsertLen, "%d", 23);
    break;
  case SSI_IDX_PORT0_TNM:
  case SSI_IDX_PORT1_TNM:
    printed = snprintf(pcInsert, iInsertLen, "%s", "Server");
    break;
  case SSI_IDX_PORT0_TPROT:
  case SSI_IDX_PORT1_TPROT:
    printed = snprintf(pcInsert, iInsertLen, "%s", "Telnet");
    break;
  case SSI_IDX_PORT0_TIP:
  case SSI_IDX_PORT1_TIP:
    printed = (iIndex == SSI_IDX_PORT0_TIP) ?
      snprintf(pcInsert, iInsertLen, "%s", "192.168.10.1") :
      snprintf(pcInsert, iInsertLen, "%s", "192.168.10.2") ;
    break;
  case SSI_IDX_PORT0_TTO:
  case SSI_IDX_PORT1_TTO:
    printed = snprintf(pcInsert, iInsertLen, "%d", 0);
    break;
  case SSI_IDX_P0CFG_VARS:
  case SSI_IDX_P1CFG_VARS:
    switch (current_tag_part) {
    case 0:
      printed = snprintf(pcInsert, iInsertLen, "%s", script_start);
      *next_tag_part = 1;
      break;
    case 1:
      {
        const struct PortSettings *port = (iIndex == SSI_IDX_P0CFG_VARS) ? &cfg.port[0] : &cfg.port[1];
        printed = snprintf(pcInsert, iInsertLen, ser_vars_fmt,
                  (unsigned)port->baudrate, (unsigned)port->datalength,
                  (unsigned)port->parity, (unsigned)port->stopbits, (unsigned)port->flowcontrol);
        *next_tag_part = 2;
      }
      break;
    case 2:
      {
        const struct PortSettings *port = (iIndex == SSI_IDX_P0CFG_VARS) ? &cfg.port[0] : &cfg.port[1];
        printed = snprintf(pcInsert, iInsertLen, telnet_vars_fmt,
                  (unsigned)port->timeout,
                  (unsigned)port->localport,
                  (unsigned)port->remoteport,
                  port->mode ? 1 : 0 , port->protocol ? 1 : 0);
        *next_tag_part = 3;
      }
      break;
    case 3:
      {
        const struct PortSettings *port = (iIndex == SSI_IDX_P0CFG_VARS) ? &cfg.port[0] : &cfg.port[1];
        printed = snprintf(pcInsert, iInsertLen, telnet_ip_vars_fmt,
                    getIPField(port->ip, 1), getIPField(port->ip, 2),
                    getIPField(port->ip, 3), getIPField(port->ip, 4));
        *next_tag_part = 4;
      }
      break;
    case 4:
      printed = snprintf(pcInsert, iInsertLen, "%s", "SetCfgFormDefaults();\n");
      *next_tag_part = 5;
      break;
    case 5:
      printed = snprintf(pcInsert, iInsertLen, "%s", script_end);
      // don't change *next_tag_part value for last part
      break;
    default:
      break;
    }

    break;
  case SSI_IDX_MISC_VARS:
    switch (current_tag_part) {
    case 0:
      printed = snprintf(pcInsert, iInsertLen, "%s", script_start);
      *next_tag_part = 1;
      break;
    case 1:
      printed = snprintf(pcInsert, iInsertLen, static_ip_vars_fmt,
        cfg.static_ip ? 1 : 0,
        getIPField(cfg.ip, 1), getIPField(cfg.ip, 2),
        getIPField(cfg.ip, 3), getIPField(cfg.ip, 4));
      *next_tag_part = 2;
      break;
    case 2:
      printed = snprintf(pcInsert, iInsertLen, netmask_vars_fmt,
        getIPField(cfg.netmask, 1), getIPField(cfg.netmask, 2),
        getIPField(cfg.netmask, 3), getIPField(cfg.netmask, 4));
      *next_tag_part = 3;
      break;
    case 3:
      printed = snprintf(pcInsert, iInsertLen, gateway_vars_fmt,
        getIPField(cfg.gateway, 1), getIPField(cfg.gateway, 2),
        getIPField(cfg.gateway, 3), getIPField(cfg.gateway, 4));
      *next_tag_part = 4;
      break;
    case 4:
      printed = snprintf(pcInsert, iInsertLen, "%s", "SetMiscFormDefaults();\n");
      *next_tag_part = 5;
      break;
    case 5:
      printed = snprintf(pcInsert, iInsertLen, "%s", script_end);
      // don't change *next_tag_part value for last part
      break;
    default:
      break;
    }
    break;
  case SSI_IDX_HOSTNAME_INP:
    printed = snprintf(pcInsert, iInsertLen, hostname_inp_vars_fmt, cfg.hostname);
    break;
#if 0
  case 2: /* "MultPart" */
#if LWIP_HTTPD_SSI_MULTIPART
    switch (current_tag_part) {
    case 0:
      printed = snprintf(pcInsert, iInsertLen, "part0");
      *next_tag_part = 1;
      break;
    case 1:
      printed = snprintf(pcInsert, iInsertLen, "part1");
      *next_tag_part = 2;
      break;
    case 2:
      printed = snprintf(pcInsert, iInsertLen, "part2");
      break;
    default:
      printed = snprintf(pcInsert, iInsertLen, "unhandled part: %d", (int)current_tag_part);
      break;
    }
#else
    printed = snprintf(pcInsert, iInsertLen, "LWIP_HTTPD_SSI_MULTIPART disabled");
#endif
    break;
#if LWIP_HTTPD_EXAMPLE_SSI_SIMPLE_CGI_INTEGRATION
  case 3:
    if (connection_state) {
      char *params = (char *)connection_state;
      if (*params) {
        printed = snprintf(pcInsert, iInsertLen, "%s", (char *)params);
      } else {
        printed = snprintf(pcInsert, iInsertLen, "none");
      }
    } else {
       printed = snprintf(pcInsert, iInsertLen, "NULL");
    }
    break;
#endif
#endif
  default: /* unknown tag */
    printed = 0;
    break;
  }
  LWIP_ASSERT("sane length", printed <= 0xFFFF);
  return (u16_t)printed;
}

