KunYi/M480_VSCODE_Template/src/webserver.c
static void ssi_ex_init(void)
{
  int i;
  for (i = 0; i < LWIP_ARRAYSIZE(ssi_example_tags); i++) {
    LWIP_ASSERT("tag too long for LWIP_HTTPD_MAX_TAG_NAME_LEN",
      strlen(ssi_example_tags[i]) <= LWIP_HTTPD_MAX_TAG_NAME_LEN);
  }

  http_set_ssi_handler(ssi_example_ssi_handler,
#if LWIP_HTTPD_SSI_RAW
    NULL, 0
#else
    ssi_example_tags, LWIP_ARRAYSIZE(ssi_example_tags)
#endif
    );
}

void *
fs_state_init(struct fs_file *file, const char *name)
{
  char *ret;
  LWIP_UNUSED_ARG(file);
  LWIP_UNUSED_ARG(name);
  ret = (char *)mem_malloc(MAX_CGI_LEN);
  if (ret) {
    *ret = 0;
  }
  return ret;
}

void
fs_state_free(struct fs_file *file, void *state)
{
  LWIP_UNUSED_ARG(file);
  if (state != NULL) {
    mem_free(state);
  }
}

void
httpd_cgi_handler(struct fs_file *file, const char* uri, int iNumParams,
                              char **pcParam, char **pcValue
#if defined(LWIP_HTTPD_FILE_STATE) && LWIP_HTTPD_FILE_STATE
                                     , void *connection_state
#endif /* LWIP_HTTPD_FILE_STATE */
                                     )
{
  LWIP_UNUSED_ARG(file);
  LWIP_UNUSED_ARG(uri);

  (void)pcParam;
  (void)pcValue;

#if defined(LWIP_HTTPD_FILE_STATE) && LWIP_HTTPD_FILE_STATE
  if (connection_state != NULL) {
    char *start = (char *)connection_state;
    char *end = start + MAX_CGI_LEN;
    int i;
    memset(start, 0, MAX_CGI_LEN);
    /* print a string of the arguments: */
    for (i = 0; i < iNumParams; i++) {
      size_t len;
      len = end - start;
      if (len) {
        size_t inlen = strlen(pcParam[i]);
        size_t copylen = LWIP_MIN(inlen, len);
        memcpy(start, pcParam[i], copylen);
        start += copylen;
        len -= copylen;
      }
      if (len) {
        *start = '=';
        start++;
        len--;
      }
      if (len) {
        size_t inlen = strlen(pcValue[i]);
        size_t copylen = LWIP_MIN(inlen, len);
        memcpy(start, pcValue[i], copylen);
        start += copylen;
        len -= copylen;
      }
      if (len) {
        *start = ';';
        len--;
      }
      /* ensure NULL termination */
      end--;
      *end = 0;
    }
  }
#endif /* LWIP_HTTPD_FILE_STATE */
}


/*
 * -------------------------------------------------------------------------------------------------------
 *  End of SSI Support Part
 * -------------------------------------------------------------------------------------------------------
 */

/*
 * -------------------------------------------------------------------------------------------------------
 *  Post Support Part
 * -------------------------------------------------------------------------------------------------------
 */

#define USER_PASS_BUFSIZE 16

static void *current_connection;
static void *valid_connection;
static char last_user[USER_PASS_BUFSIZE];
static uint16_t postPageIndex = 0;

static unsigned isU32Num(const char str[], const unsigned len)
{
  uint8_t i;

  if (len > 10)
    return 0;

  for (i = 0; i < len; i++)
  {
    char c = str[i];
    if (isdigit(c) == 0)
      return 0;
  }

  return 1;
}

static uint32_t getUint32Var(const struct pbuf *p, uint32_t *val, const char *fmt, const uint8_t lenFmt)
{
  uint16_t token;
  uint16_t value;
  uint16_t tmp;
  uint16_t len;
  char *pValue;
  char buf[12] = { 0 }; // uint32_t: max value:4294967295, len must < 11

  token = pbuf_memfind(p, fmt, lenFmt, 0);
  if (token == 0xFFFF) {
    printf("not found:%s\n", buf);
    return 0;
  }

  value = token + lenFmt;
  tmp = pbuf_memfind(p, "&", 1, value);
  if (tmp == 0xFFFF) {
    len = p->tot_len - value;
  } else {
    len = tmp - value;
  }
  /* avoid over buffer space */
  if (len > (sizeof(buf) - 1)) return 0;

  memset(buf, 0, sizeof(buf));
  pValue = (char *)pbuf_get_contiguous(p, buf, sizeof(buf), len, value);
  memcpy(buf, pValue, len);
  if(isU32Num(buf, len)) {
    *val = atol(buf);
    return 1;
  }
  return 0;
}

static uint32_t getIpVar(const struct pbuf *p, const char *fmt, const uint8_t lenFmt)
{
  uint8_t i;
  uint32_t val;
  uint32_t ip = 0;
  char buf[8] = { 0 };

  for (i = 1; i <= 4; i++) {
    snprintf(buf, sizeof(buf) - 1, fmt, i);
    if ((!getUint32Var(p, &val, buf, lenFmt)) || val > 255)
      return ~(uint32_t)0;
    ip += val << (8 * (4 - i));
  }
  return ip;
}

static void procLogin(const struct pbuf *p) {

}

static void procConfig(const struct pbuf *p) {
  const u16_t token_port = pbuf_memfind(p, "port=", 5, 0);
  printf("procConfig\n");
}

static void procIpCfg(const struct pbuf *p) {
  uint32_t mode = ~(uint32_t)0;
  const uint32_t static_ip = getIpVar(p, "sip%d=", 5);
  const uint32_t mask = getIpVar(p, "mip%d=", 5);
  const uint32_t gateway = getIpVar(p, "gip%d=", 5);

  getUint32Var(p, &mode, "staticip=", 9);
  printf("procIpCfg, mode:%ld, ip=%08lx, mask=%08lx, gateway=%08lx\n",
      mode, static_ip, mask, gateway);
}

static void procMiscCfg(const struct pbuf *p) {
  printf("procMiscCfg\n");
}

static void procDefaultCfg(const struct pbuf *p) {
  printf("procDefaultCfg\n");
}

struct post_uri {
  const char *uri;
  uint8_t     len_uri;
  const char *response;
};

enum {
  POST_IDX_LOGIN        =   0,
  POST_IDX_CONFIG       =   1,
  POST_IDX_IP_CGI       =   2,
  POST_IDX_MISC_CGI     =   3,
  POST_IDX_DEFAULT_CGI  =   4,
};

static const struct post_uri  postPage[] =
{
  { "/login.cgi",     10, "/loginfail.html" },
  { "/config.cgi",    11, "/test.html"},
  /* in misc.shtm */
  { "/ip.cfg",         7, "/test.html"},
  { "/misc.cgi",       9, "/test.html"},
  { "/defaults.cgi",  13, "/test.html"},
};

typedef void (*procProc)(const struct pbuf *p);

static const procProc procPostVariablesFuncs[] = {
  procLogin,
  procConfig,
  procIpCfg,
  procMiscCfg,
  procDefaultCfg,
};

void dispatchPost(const char *uri, char *response_uri, const u16_t response_uri_len)
{
  const uint8_t pages = (sizeof(postPage)/sizeof(struct post_uri));
  uint8_t i;

  /* not found */
  postPageIndex = 0xFFFF;
  for (i = 0; i < pages; i++) {
     if (memcmp(postPage[i].uri, uri, postPage[i].len_uri) && (strlen(uri) == postPage[i].len_uri)) {
        snprintf(response_uri, response_uri_len, postPage[i].response);
        postPageIndex = i;
       break;
     }
  }

